STRART_FOR_MAIN_ADMIN ="""درود 🙌🏻

به داشبورد مدیریت وال بات خوش آمدید.

💻 devlop by: @primez_dev
🐋 wall bot (v 2.3.3)"""

START_FOR_ADMINS ="""درود 🙌🏻

به پنل مدیریت کاربران ویتوری وال بات خوش آمدید.


🐋 wall bot (v 2.3.3)"""


ADD_ADMIN_1 ="""1⃣ مرحله اول

لطفا یک یوزر نیم یونیک (انگلیسی) وارد کنید:"""

ADD_ADMIN_2 ="""2⃣ مرحله دوم

لطفا یک پسورد یونیک (انگلیسی) وارد کنید:"""

ADD_ADMIN_3 ="""3⃣ مرحله سوم

لطفا مقدار ترافیک قابل استفاده (عدد انگلیسی) برای این ادمین وارد کنید:"""


ADD_ADMIN_4 ="""4⃣ مرحله چهارم 

لطفا ایدی سطراینباند مدنظر (عدد انگلیسی) ، مختص این ادمین را وارد کنید:"""


ADD_EMAIL ="""1⃣ مرحله اول

لطفا یک یوزر نیم یونیک وارد کنید:"""

ADD_TRAFFIC = """3⃣ مرحله سوم

لطفا ترافیک قابل استفاده (عدد انگلیسی) بر حسب GB برای این کاربر را وارد کنید:"""

ADD_DAYS ="""2⃣ مرحله دوم

لطفا تعداد روز های قابل استفاده (عدد انگلیسی) برای این کاربر را وارد کنید:"""

RENEW_USER ="""⚠️ توجه 

‼️با تمدید کاربر مورد نظر ترافیک اون کاربر ریست خواهد شد اما تعداد روز های اشتراکش رو شما در مرحله بعدی تعیین میکنید.

🔹درصورت تمایل نام کاربری مورد نظر رو وارد کنید:"""


CHANGE_INB_ID ="""⚠️ توجه 

‼️با تغییر اینباند یک ادمین، کاربران قبلی اون دیگه براش نشون داده نمیشه ، درصورت نیاز میتونید از طریق خود پنل بصورت یکجا کاربرارو از اینباند قبلی کات و به اینباند جدید منتقل کنید.

1⃣مرحله اول

درصورت تمایل تعویض اینباند ، یوزرنیم ادمین مورد نظر رو وارد کنید:"""

HELP_MESSAGE = """⚠️ متن راهنما خالی است"""
